{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from rdflib import Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=N0b813bd2425e48f292039bc643aae2dc (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g = Graph()\n",
    "g.parse('./full_KG_final.ttl', format='ttl')"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "---\n",
    "### <b>Query:</b> Return a list of artists and their names who produce songs with genres other than \"pop\" and \"dance pop.\"\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['http://example.org/Train', 'Train']\n",
      "['http://example.org/Eminem', 'Eminem']\n",
      "['http://example.org/Justin%20Bieber', 'Justin Bieber']\n",
      "['http://example.org/Alicia%20Keys', 'Alicia Keys']\n",
      "['http://example.org/Rihanna', 'Rihanna']\n",
      "['http://example.org/Usher', 'Usher']\n",
      "['http://example.org/Adam%20Lambert', 'Adam Lambert']\n",
      "['http://example.org/Neon%20Trees', 'Neon Trees']\n",
      "['http://example.org/Florence%20%2B%20The%20Machine', 'Florence + The Machine']\n",
      "['http://example.org/Shakira', 'Shakira']\n",
      "['http://example.org/T.I.', 'T.I.']\n",
      "['http://example.org/Martin%20Solveig', 'Martin Solveig']\n",
      "['http://example.org/Adele', 'Adele']\n",
      "['http://example.org/Avril%20Lavigne', 'Avril Lavigne']\n",
      "['http://example.org/Kanye%20West', 'Kanye West']\n",
      "['http://example.org/Jessie%20J', 'Jessie J']\n",
      "['http://example.org/Sleeping%20At%20Last', 'Sleeping At Last']\n",
      "['http://example.org/Coldplay', 'Coldplay']\n",
      "['http://example.org/One%20Direction', 'One Direction']\n",
      "['http://example.org/Carly%20Rae%20Jepsen', 'Carly Rae Jepsen']\n",
      "['http://example.org/The%20Wanted', 'The Wanted']\n",
      "['http://example.org/fun.', 'fun.']\n",
      "['http://example.org/Avicii', 'Avicii']\n",
      "['http://example.org/The%20Script', 'The Script']\n",
      "['http://example.org/Swedish%20House%20Mafia', 'Swedish House Mafia']\n",
      "['http://example.org/Daft%20Punk', 'Daft Punk']\n",
      "['http://example.org/Zedd', 'Zedd']\n",
      "['http://example.org/Lana%20Del%20Rey', 'Lana Del Rey']\n",
      "['http://example.org/Drake', 'Drake']\n",
      "['http://example.org/Sara%20Bareilles', 'Sara Bareilles']\n",
      "['http://example.org/Icona%20Pop', 'Icona Pop']\n",
      "['http://example.org/Jonas%20Brothers', 'Jonas Brothers']\n",
      "['http://example.org/Jewel', 'Jewel']\n",
      "['http://example.org/Kelly%20Rowland', 'Kelly Rowland']\n",
      "['http://example.org/John%20Legend', 'John Legend']\n",
      "['http://example.org/Passenger', 'Passenger']\n",
      "['http://example.org/Bastille', 'Bastille']\n",
      "['http://example.org/Lorde', 'Lorde']\n",
      "['http://example.org/Disclosure', 'Disclosure']\n",
      "['http://example.org/5%20Seconds%20of%20Summer', '5 Seconds of Summer']\n",
      "['http://example.org/Iggy%20Azalea', 'Iggy Azalea']\n",
      "['http://example.org/The%20Chainsmokers', 'The Chainsmokers']\n",
      "['http://example.org/Birdy', 'Birdy']\n",
      "['http://example.org/A%20Great%20Big%20World', 'A Great Big World']\n",
      "['http://example.org/Sia', 'Sia']\n",
      "['http://example.org/Charli%20XCX', 'Charli XCX']\n",
      "['http://example.org/Lea%20Michele', 'Lea Michele']\n",
      "['http://example.org/The%20Weeknd', 'The Weeknd']\n",
      "['http://example.org/Hozier', 'Hozier']\n",
      "['http://example.org/Shawn%20Mendes', 'Shawn Mendes']\n",
      "['http://example.org/Mr.%20Probz', 'Mr. Probz']\n",
      "['http://example.org/Paloma%20Faith', 'Paloma Faith']\n",
      "['http://example.org/Naughty%20Boy', 'Naughty Boy']\n",
      "['http://example.org/Alessia%20Cara', 'Alessia Cara']\n",
      "['http://example.org/Lost%20Frequencies', 'Lost Frequencies']\n",
      "['http://example.org/Lilly%20Wood%20and%20The%20Prick', 'Lilly Wood and The Prick']\n",
      "['http://example.org/Wiz%20Khalifa', 'Wiz Khalifa']\n",
      "['http://example.org/Alesso', 'Alesso']\n",
      "['http://example.org/Martin%20Garrix', 'Martin Garrix']\n",
      "['http://example.org/Lukas%20Graham', 'Lukas Graham']\n",
      "['http://example.org/G-Eazy', 'G-Eazy']\n",
      "['http://example.org/B%C3%83%CB%9CRNS', 'BØRNS']\n",
      "['http://example.org/Joey%20Montana', 'Joey Montana']\n",
      "['http://example.org/Nelly%20Furtado', 'Nelly Furtado']\n",
      "['http://example.org/DJ%20Snake', 'DJ Snake']\n",
      "['http://example.org/Kygo', 'Kygo']\n",
      "['http://example.org/Luis%20Fonsi', 'Luis Fonsi']\n",
      "['http://example.org/CNCO', 'CNCO']\n",
      "['http://example.org/Alan%20Walker', 'Alan Walker']\n",
      "['http://example.org/Cashmere%20Cat', 'Cashmere Cat']\n",
      "['http://example.org/Galantis', 'Galantis']\n",
      "['http://example.org/Silk%20City', 'Silk City']\n",
      "['http://example.org/Marshmello', 'Marshmello']\n",
      "['http://example.org/Dan%20%2B%20Shay', 'Dan + Shay']\n",
      "['http://example.org/J%20Balvin', 'J Balvin']\n",
      "['http://example.org/N.E.R.D', 'N.E.R.D']\n",
      "['http://example.org/RedOne', 'RedOne']\n",
      "['http://example.org/SHAED', 'SHAED']\n",
      "['http://example.org/Lizzo', 'Lizzo']\n",
      "['http://example.org/Khalid', 'Khalid']\n",
      "['http://example.org/R3HAB', 'R3HAB']\n",
      "['http://example.org/Daddy%20Yankee', 'Daddy Yankee']\n"
     ]
    }
   ],
   "source": [
    "q = \"\"\"\n",
    "PREFIX schema: <https://schema.org/>\n",
    "\n",
    "SELECT DISTINCT ?artist ?artist_name\n",
    "WHERE {\n",
    "  ?song schema:byArtist ?artist .\n",
    "  ?song schema:genre ?genre .\n",
    "  ?artist rdfs:label ?artist_name .\n",
    "  ?genre rdfs:label ?genre_name .\n",
    "  FILTER(?genre_name != \"pop\"@en && ?genre_name != \"dance pop\"@en)\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "result = g.query(q)\n",
    "for r in result:\n",
    "    print([str(r[0]), str(r[1])])"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "---\n",
    "### <b>Query:</b> Return a list of songs released in 2016 by artists born before 1990."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Song: Million Reasons \n",
      "Released: 2016 \n",
      "Artist born in: 1986 \n",
      "\n",
      "Song: Perfect Illusion \n",
      "Released: 2016 \n",
      "Artist born in: 1986 \n",
      "\n",
      "Song: Needed Me \n",
      "Released: 2016 \n",
      "Artist born in: 1988 \n",
      "\n",
      "Song: Work \n",
      "Released: 2016 \n",
      "Artist born in: 1988 \n",
      "\n",
      "Song: I Took A Pill In Ibiza - Seeb Remix \n",
      "Released: 2016 \n",
      "Artist born in: 1988 \n",
      "\n",
      "Song: Make Me... (feat. G-Eazy) \n",
      "Released: 2016 \n",
      "Artist born in: 1981 \n",
      "\n",
      "Song: Invitation \n",
      "Released: 2016 \n",
      "Artist born in: 1981 \n",
      "\n",
      "Song: Do You Wanna Come Over? \n",
      "Released: 2016 \n",
      "Artist born in: 1981 \n",
      "\n",
      "Song: All I Ask \n",
      "Released: 2016 \n",
      "Artist born in: 1988 \n",
      "\n",
      "Song: Send My Love (To Your New Lover) \n",
      "Released: 2016 \n",
      "Artist born in: 1988 \n",
      "\n",
      "Song: When We Were Young \n",
      "Released: 2016 \n",
      "Artist born in: 1988 \n",
      "\n",
      "Song: Million Years Ago \n",
      "Released: 2016 \n",
      "Artist born in: 1988 \n",
      "\n",
      "Song: Out Of The Woods \n",
      "Released: 2016 \n",
      "Artist born in: 1989 \n",
      "\n",
      "Song: Run Away With Me \n",
      "Released: 2016 \n",
      "Artist born in: 1985 \n",
      "\n",
      "Song: Higher \n",
      "Released: 2016 \n",
      "Artist born in: 1985 \n",
      "\n",
      "Song: True Colors \n",
      "Released: 2016 \n",
      "Artist born in: 1989 \n",
      "\n",
      "Song: This Is What You Came For \n",
      "Released: 2016 \n",
      "Artist born in: 1984 \n",
      "\n",
      "Song: CAN'T STOP THE FEELING! (Original Song from DreamWorks Animation's \"TROLLS\") \n",
      "Released: 2016 \n",
      "Artist born in: 1981 \n",
      "\n",
      "Song: Start \n",
      "Released: 2016 \n",
      "Artist born in: 1978 \n",
      "\n",
      "Song: Beautiful Birds (feat. Birdy) \n",
      "Released: 2016 \n",
      "Artist born in: 1984 \n",
      "\n",
      "Song: Runnin' (Lose It All) \n",
      "Released: 2016 \n",
      "Artist born in: 1981 \n",
      "\n",
      "Song: Make Me Like You \n",
      "Released: 2016 \n",
      "Artist born in: 1969 \n",
      "\n",
      "Song: Me, Myself & I \n",
      "Released: 2016 \n",
      "Artist born in: 1989 \n",
      "\n",
      "Song: I Got You \n",
      "Released: 2016 \n",
      "Artist born in: 1989 \n",
      "\n",
      "Song: WTF (Where They From) \n",
      "Released: 2016 \n",
      "Artist born in: 1971 \n",
      "\n",
      "Song: Pep Rally \n",
      "Released: 2016 \n",
      "Artist born in: 1971 \n",
      "\n",
      "Song: BURNITUP! \n",
      "Released: 2016 \n",
      "Artist born in: 1966 \n",
      "\n",
      "Song: Picky - Remix \n",
      "Released: 2016 \n",
      "Artist born in: 1982 \n",
      "\n"
     ]
    }
   ],
   "source": [
    "q = \"\"\"\n",
    "PREFIX schema: <https://schema.org/>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "\n",
    "SELECT DISTINCT ?song_name ?released (YEAR(?birthDate) as ?birthYear)\n",
    "WHERE {\n",
    "  ?song schema:byArtist ?artist .\n",
    "  ?song rdfs:label ?song_name .\n",
    "  ?song schema:datePublished ?released .\n",
    "  ?artist owl:sameAs ?realArtist .\n",
    "  ?realArtist dbo:birthDate ?birthDate .\n",
    "  FILTER(?released = \"2016\"^^xsd:gYear && YEAR(?birthDate) < 1990)\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "result = g.query(q)\n",
    "for r in result:\n",
    "    print(\"Song:\",str(r[0]), \"\\nReleased:\", str(r[1]), \"\\nArtist born in:\", str(r[2]), \"\\n\")\n"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "---\n",
    "### <b>Query:</b> Who is the artist that has produced the greatest number of songs?\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Katy Perry with 17 songs\n"
     ]
    }
   ],
   "source": [
    "q = \"\"\"\n",
    "PREFIX ex: <http://example.org/>\n",
    "PREFIX schema: <https://schema.org/>\n",
    "\n",
    "SELECT ?artist_name (COUNT(?song) as ?sum_songs)\n",
    "WHERE {\n",
    "  ?song schema:byArtist ?artist .\n",
    "  ?artist rdfs:label ?artist_name .\n",
    "}\n",
    "GROUP BY ?artist\n",
    "ORDER BY DESC(?sum_songs)\n",
    "LIMIT 1\n",
    "\"\"\"\n",
    "\n",
    "result = g.query(q)\n",
    "for r in result:\n",
    "  print(str(r[0]), \"with\", str(r[1]), \"songs\")"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "---\n",
    "<b>Query:</b> Return a list of artists born in the USA, sorted by the number of songs they have produced."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Lady Gaga was born in New York City, U.S. and produced 14 songs\n",
      "Bruno Mars was born in Honolulu, Hawaii, U.S. and produced 13 songs\n",
      "Ariana Grande was born in Boca Raton, Florida, U.S. and produced 9 songs\n",
      "Britney Spears was born in McComb, Mississippi, U.S. and produced 9 songs\n",
      "Justin Timberlake was born in Memphis, Tennessee, U.S. and produced 9 songs\n",
      "Demi Lovato was born in Albuquerque, New Mexico, U.S. and produced 8 songs\n",
      "Selena Gomez was born in Grand Prairie, Texas, U.S. and produced 8 songs\n",
      "Taylor Swift was born in West Reading, Pennsylvania, U.S. and produced 8 songs\n",
      "Alicia Keys was born in New York City, U.S. and produced 6 songs\n",
      "Meghan Trainor was born in Nantucket, Massachusetts, U.S. and produced 6 songs\n",
      "Kelly Clarkson was born in Fort Worth, Texas, U.S. and produced 5 songs\n",
      "Miley Cyrus was born in Franklin, Tennessee, U.S. and produced 5 songs\n",
      "Jason Derulo was born in Miramar, Florida, U.S. and produced 4 songs\n",
      "Lana Del Rey was born in New York City, U.S. and produced 4 songs\n",
      "Nick Jonas was born in Dallas, Texas, U.S. and produced 4 songs\n",
      "Charlie Puth was born in Rumson, New Jersey, U.S. and produced 3 songs\n",
      "Chris Brown was born in Tappahannock, Virginia, U.S. and produced 3 songs\n",
      "Christina Perri was born in Bensalem, Pennsylvania, U.S. and produced 3 songs\n",
      "Fergie was born in Hacienda Heights, California, U.S. and produced 3 songs\n",
      "Gwen Stefani was born in Fullerton, California, U.S. and produced 3 songs\n",
      "Mike Posner was born in Detroit, Michigan, U.S. and produced 3 songs\n",
      "Austin Mahone was born in San Antonio, Texas, U.S. and produced 2 songs\n",
      "Bebe Rexha was born in Brooklyn, New York City, U.S. and produced 2 songs\n",
      "Eminem was born in St. Joseph, Missouri, U.S. and produced 2 songs\n",
      "Flo Rida was born in Miami Gardens, Florida, U.S. and produced 2 songs\n",
      "G-Eazy was born in Oakland, California, U.S. and produced 2 songs\n",
      "John Legend was born in Springfield, Ohio, U.S. and produced 2 songs\n",
      "Lizzo was born in Detroit, Michigan, U.S. and produced 2 songs\n",
      "Lost Frequencies was born in Brussels, Belgium and produced 2 songs\n",
      "Marshmello was born in Philadelphia, Pennsylvania, U.S. and produced 2 songs\n",
      "Missy Elliott was born in Portsmouth, Virginia, U.S. and produced 2 songs\n",
      "Pharrell Williams was born in Virginia Beach, Virginia, U.S. and produced 2 songs\n",
      "Robin Thicke was born in Los Angeles, California, U.S. and produced 2 songs\n",
      "Tinie Tempah was born in Plumstead, London, England and produced 2 songs\n",
      "Ciara was born in Fort Hood, Texas, U.S. and produced 1 songs\n",
      "Halsey was born in Edison, New Jersey, U.S. and produced 1 songs\n",
      "Janet Jackson was born in Gary, Indiana, U.S. and produced 1 songs\n",
      "Jennifer Hudson was born in Chicago, Illinois, U.S. and produced 1 songs\n",
      "Kanye West was born in Atlanta, Georgia, U.S. and produced 1 songs\n",
      "Michael Jackson was born in Gary, Indiana, U.S. and produced 1 songs\n",
      "Ne-Yo was born in Camden, Arkansas, U.S. and produced 1 songs\n",
      "Sean Kingston was born in Miami, Florida, U.S. and produced 1 songs\n",
      "Wiz Khalifa was born in Minot, North Dakota, U.S. and produced 1 songs\n",
      "will.i.am was born in Los Angeles, California, U.S. and produced 1 songs\n"
     ]
    }
   ],
   "source": [
    "q = \"\"\"\n",
    "PREFIX schema: <https://schema.org/>\n",
    "PREFIX dbp: <http://dbpedia.org/property/>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "\n",
    "SELECT ?artist_name ?birthPlace (COUNT(?song) as ?sum_songs)\n",
    "WHERE {\n",
    "  ?song schema:byArtist ?artist .\n",
    "  ?artist owl:sameAs ?realArtist .\n",
    "  ?artist rdfs:label ?artist_name .\n",
    "  ?realArtist dbp:birthPlace ?birthPlace .\n",
    "  FILTER regex(?birthPlace, \"U.S.\", \"i\")\n",
    "}\n",
    "GROUP BY ?artist\n",
    "ORDER BY DESC(?sum_songs)\n",
    "\"\"\"\n",
    "\n",
    "result = g.query(q)\n",
    "for r in result:\n",
    "  print(str(r[0]), \"was born in\", str(r[1]), \"and produced\", str(r[2]), \"songs\")\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "---\n",
    "<b>Query:</b> Find artists whose song names contain the word \"love\" and sort the artists by the\n",
    "resulting number of songs.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Justin Bieber with 2 song(s)\n",
      "OneRepublic with 2 song(s)\n",
      "Rihanna with 2 song(s)\n",
      "Maroon 5 with 2 song(s)\n",
      "Beyoncé with 2 song(s)\n",
      "Selena Gomez with 2 song(s)\n",
      "Sigala with 2 song(s)\n",
      "Eminem with 1 song(s)\n",
      "Kesha with 1 song(s)\n",
      "Usher with 1 song(s)\n",
      "Selena Gomez & The Scene with 1 song(s)\n",
      "Enrique Iglesias with 1 song(s)\n",
      "Katy Perry with 1 song(s)\n",
      "Adele with 1 song(s)\n",
      "Pitbull with 1 song(s)\n",
      "Ellie Goulding with 1 song(s)\n",
      "Demi Lovato with 1 song(s)\n",
      "Lana Del Rey with 1 song(s)\n",
      "Calvin Harris with 1 song(s)\n",
      "Ne-Yo with 1 song(s)\n",
      "Ariana Grande with 1 song(s)\n",
      "Icona Pop with 1 song(s)\n",
      "Fergie with 1 song(s)\n",
      "Little Mix with 1 song(s)\n",
      "Austin Mahone with 1 song(s)\n",
      "John Newman with 1 song(s)\n",
      "Michael Jackson with 1 song(s)\n",
      "Paloma Faith with 1 song(s)\n",
      "Madonna with 1 song(s)\n",
      "Martin Garrix with 1 song(s)\n",
      "BØRNS with 1 song(s)\n",
      "DJ Snake with 1 song(s)\n",
      "Kygo with 1 song(s)\n",
      "Cashmere Cat with 1 song(s)\n",
      "Halsey with 1 song(s)\n",
      "Lewis Capaldi with 1 song(s)\n"
     ]
    }
   ],
   "source": [
    "q = \"\"\"\n",
    "PREFIX schema: <https://schema.org/>\n",
    "\n",
    "SELECT ?artist_name (COUNT(?song) as ?sum_songs)\n",
    "WHERE {\n",
    "  ?song schema:byArtist ?artist .\n",
    "  ?song rdfs:label ?song_name .\n",
    "  ?artist rdfs:label ?artist_name .\n",
    "  FILTER regex(?song_name, \"love\", \"i\")\n",
    "}\n",
    "GROUP BY ?artist\n",
    "ORDER BY DESC(?sum_songs)\n",
    "\"\"\"\n",
    "\n",
    "result = g.query(q)\n",
    "for r in result:\n",
    "    print(str(r[0]), \"with\", str(r[1]), \"song(s)\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.13"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
